DATA = {
    'omlet': {
        'яйца, шт': 2,
        'молоко, л': 0.1,
        'соль, ч.л.': 0.5,
    },
    'pasta': {
        'макароны, г': 0.3,
        'сыр, г': 0.05,
    },
    'buter': {
        'хлеб, ломтик': 1,
        'колбаса, ломтик': 1,
        'сыр, ломтик': 1,
        'помидор, ломтик': 1,
    },
    'soup': {
        'картофель, шт': 3,
        'морковь, шт': 1,
        'лук репчатый, шт': 1,
        'вода, л': 1.5,
        'соль, ч.л.': 0.5,
    },
    'salad': {
        'огурец, шт': 2,
        'помидор, шт': 2,
        'листья салата, пучок': 1,
        'уксус, ст.л.': 1,
        'соль, ч.л.': 0.5,
    },
    'fish': {
        'рыба, филе, г': 200,
        'лимонный сок, ст.л.': 1,
        'соль, ч.л.': 0.5,
        'перец черный молотый, ч.л.': 0.25,
    },
    'potato_chips': {
        'картофель, шт': 2,
        'масло растительное, мл': 20,
        'соль, ч.л.': 0.5,
    },
    'stew': {
        'говядина, г': 400,
        'морковь, шт': 1,
        'лук репчатый, шт': 1,
        'вода, л': 1,
        'соль, ч.л.': 0.5,
    },
    'pancakes': {
        'мука, г': 150,
        'молоко, л': 0.5,
        'яйцо, шт': 1,
        'соль, ч.л.': 0.5,
    },
    'milkshake': {
        'молоко, л': 0.5,
        'банан, шт': 1,
        'ванильный сахар, ч.л.': 1,
    },
    'cottage_cheese_cake': {
        'творог, г': 200,
        'сметана, г': 50,
        'яйцо, шт': 1,
        'сахар, ст.л.': 2,
        'изюм, ст.л.': 1,
    },
    'muesli': {
        'хлопья, ст.л.': 3,
        'молоко, л': 0.2,
        'фрукты, ст.л.': 1,
    },
    'omelette': {
        'яйца, шт': 3,
        'молоко, л': 0.1,
        'соль, ч.л.': 0.5,
        'ветчина, ломтик': 1,
    },
    'breaded_chicken': {
        'курица, филе, г': 200,
        'панировочные сухари, г': 50,
        'яйцо, шт': 1,
        'соль, ч.л.': 0.5,
    },
    'pizza': {
        'тесто для пиццы, г': 200,
        'томатный соус, ст.л.': 2,
        'сыр моцарелла, г': 70,
        'ветчина, ломтик': 2,
        'помидоры, ломтик': 2,
    },
    'chocolate_cake': {
        'шоколад, г': 100,
        'масло сливочное, г': 50,
        'сахар, ст.л.': 2,
        'яйцо, шт': 1,
        'мука, г': 50,
    },
}
import json


with open('recipes/recipes.json', 'w', encoding='utf-8') as f:
    res = json.dumps(DATA)
    json.dump(DATA, f, indent=3)

